emacs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-02-08 Sat 01:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Personal Website</title>
<meta name="author" content="Harshit Modi" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="emac.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">My Personal Website</h1>

<div id="outline-container-org45df8fc" class="outline-2">
<h2 id="org45df8fc">Hey, I’m Harshit!</h2>
<div class="outline-text-2" id="text-org45df8fc">
<p>
Navigating through my Computer Science degree at UIC with a surprisingly stable 3.62 GPA—I guess it hasn’t figured out yet that I’m totally winging it. If I play my cards right (and don't bomb my finals), I’ll be outta there with a degree in December 2025.
</p>
</div>
</div>

<div id="outline-container-org805ce3d" class="outline-2">
<h2 id="org805ce3d">Current Gigs:</h2>
<div class="outline-text-2" id="text-org805ce3d">
<p>
Teaching Assistant for CS 261: I’ve got 300 students signed up, but 50 elite ever show up to see if I actually exist. My teaching style? A sprinkle of sarcasm and pretending I know what I am doing.
</p>

<p>
Human-Computer Interaction Research at UIC Elicit Lab: I’m basically trying to figure out why people yell at their computers. I thought they were using GNOME but Turns out, a nicer-looking screen makes them yell less. Who knew?
</p>

<p>
Coding Shenanigans at BITS Lab: I’m whipping up a Visual Studio Code extension that lights up your C code’s darkest secrets (how u probably GPTed the whole code and dont know how to debug it). Also, I’m messing with automated proof generation—because, hey, maybe it’ll crash less.
</p>
</div>
</div>

<div id="outline-container-orgce08bdf" class="outline-2">
<h2 id="orgce08bdf">Projects I Haven’t Completely Destroyed:</h2>
<div class="outline-text-2" id="text-orgce08bdf">
<p>
Unix-like Shell in C: Mostly works like a charm, until it doesn’t. Then I remember why I’m not in IT support.
</p>

<p>
Secure CLI Password Manager: A fancy way to keep passwords that doesn’t involve sticky notes. It’s built with Python, rocks AES-256 encryption, and doesn’t go through the wash.
</p>

<p>
Arc Editor: A slim text editor that can deal with files without blowing up my laptop. Tested it myself during one too many late-night coding sessions
</p>

<p>
Tic Tac Toe AI: Crafted with HTML, CSS, and JavaScript, it’s designed to make sure I can never win. Great for my ego. Also whenever I feel useless I look at it.
</p>

<p>
BlackJack Game: More exciting than my usual lectures and built in old ass JavaFX which whoever uses should have been diagnosed with severe case of psychosis.
</p>

<p>
Currently my active website which I built using HTML and CSS is hosted on <a href="https://justharsh.xyz">https://justharsh.xyz</a>
</p>
</div>
</div>

<div id="outline-container-org400788a" class="outline-2">
<h2 id="org400788a">Blogs</h2>
<div class="outline-text-2" id="text-org400788a">
<p>
I have written some great blogs related to cybersecurity. 
Visit on my <a href="blog/index.html">blog</a> here.
</p>
</div>
</div>

<div id="outline-container-org569f501" class="outline-2">
<h2 id="org569f501">Projects</h2>
<div class="outline-text-2" id="text-org569f501">
<p>
Here are some of the projects I've worked on:
</p>
<ul class="org-ul">
<li>Projects can be found on my <a href="https://github.com/hmodi51">GitHub</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-org74f987c" class="outline-2">
<h2 id="org74f987c">Contact</h2>
<div class="outline-text-2" id="text-org74f987c">
<p>
You can reach me at <a href="mailto:modiharshit01@gmail.com">Email</a>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Harshit Modi</p>
<p class="date">Created: 2025-02-08 Sat 01:20</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>